Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་། ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྟོན་པར་རིག་པར་བྱ་སྟེ།
en: The four applications of mindfulness, the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas and knowledge of the path should be known as the teachers of bodhisattva great beings.

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་ལམ་མོ།
en: Knowledge of the path [and so forth] constitute the path.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་སྣང་བའོ།
en: Knowledge of the path [and so forth] are the light.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་སྒྲོན་མའོ།
en: Knowledge of the path [and so forth] are a lamp.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་དཔུང་གཉེན་ནོ།
en: Knowledge of the path [and so forth] are an ally.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་སྐྱབས་སོ།
en: Knowledge of the path [and the foregoing attributes] are a refuge.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་མགོན་ནོ།
en: Knowledge of the path [and so forth] are a lord-protector.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་མའོ།
en: Knowledge of the path [and so forth] are a mother.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ནི་ཕའོ།
en: Knowledge of the path [and so forth] are a father. “

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ནི་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་སྤོང་བར་བྱེད་པ་སྟེ།
en: All-aspect omniscience causes all reincarnation through the continuity of propensities to be abandoned.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་ནི། འདས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཡང་ཡབ་དང་ཡུམ་དུ་གྱུར་ཏོ།
en: If you ask why, Subhūti, it is because these thirty-seven factors conducive to enlightenment have also been the father and the mother of all lord buddhas, as many as have appeared as the tathāgatas, arhats, completely awakened buddhas of the past.

source: །རབ་འབྱོར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་ནི་མ་འོངས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཡང་ཡབ་དང་ཡུམ་དུ་འགྱུར་རོ།
en: Subhūti, these thirty-seven factors conducive to enlightenment will also be the father and the mother of all lord buddhas, as many as will appear as the tathāgatas, arhats, completely awakened buddhas of the future.

source: །རབ་འབྱོར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་ནི་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་ཡང་ཡབ་དང་ཡུམ་དུ་གྱུར་ཏོ།
en: Subhūti, these thirty-seven factors conducive to enlightenment are also the father and the mother of all lord buddhas, as many as are alive and residing at present in the world systems of the ten directions.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདི་ལྟར་འདི་ལས་བྱུང་བ་ནི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཏེ།
en: If you ask why, Subhūti, it is because it is from them that the lord buddhas of the past, the future, and the present have appeared, [will appear, and are appearing].

source: རབ་འབྱོར་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བར་འདོད་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བར་འདོད་པས། བསྡུ་བའི་དངོས་པོ་བཞིས་སེམས་ཅན་རྣམས་ཡོངས་སུ་བསྡུ་བར་བྱའོ།
en: Therefore, Subhūti, bodhisattva great beings who seek to attain consummate buddhahood in unsurpassed, complete enlightenment, who seek to refine the buddhafields, and who seek to bring beings to maturity should attract beings through the four attractive qualities of a bodhisattva.

source: །བཞི་གང་ཞེ་ན། སྦྱིན་པ་དང་། ཚིག་སྙན་པ་དང་། དོན་སྤྱད་པ་དང་། དོན་མཐུན་པ་སྟེ། རབ་འབྱོར་ངས་དོན་གྱི་དབང་དེ་མཐོང་བས། འདི་སྐད་དུ་འདི་ལྟ་སྟེ།
en: If you ask what are these four, they comprise generosity, pleasant speech, purposeful activity, and harmony.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྟོན་པ་དང་། མ་དང་ཕ་དང་། དཔུང་གཉེན་དང་། སྐྱབས་དང་། མགོན་ཡིན་ནོ།
en: Considering this state of affairs, Subhūti, I say that these thirty-seven factors conducive to enlightenment are the teachers, mother, father, ally, refuge, and lord-protector of bodhisattva great beings.

source: ཞེས་བརྗོད་དོ། །རབ་འབྱོར་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཞན་གྱི་དྲིང་མི་འཇོག་པར་བྱ་བར་འདོད་པ་དང་། གཞན་གྱི་དྲིང་མི་འཇོག་པ་ལ་གནས་པར་འདོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཐེ་ཚོམ་གཅད་པར་འདོད་པ་དང་། སངས་རྒྱས་ཀྱི་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བར་འདོད་པ་དང་།
en: Therefore, Subhūti, bodhisattva great beings who seek not to depend on others, who seek to continue not depending on others, who seek to cut off the doubts of all beings, who seek to refine the buddhafields, and who seek to bring beings to maturity should train in this very perfection of wisdom.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལ་བསླབ་པར་བྱའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་གང་ལ་བསླབ་པར་བྱ་བ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས་རྒྱ་ཆེར་བསྟན་ཏོ།
en: If you ask why, it is in this perfection of wisdom that these attributes in which bodhisattva great beings should train are extensively revealed.”

source: །རབ་འབྱོར་གྱིས་གསོལ་བ།
en: Subhūti then asked, {Ki.

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་ཉིད་ཇི་ལྟ་བུ་ལགས།
en: V: 12} “Blessed Lord, what are the defining characteristics of the perfection of wisdom?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པའི་མཚན་ཉིད་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ།
en: The Blessed One replied, “Subhūti, like space, the perfection of wisdom has the defining characteristic of nonattachment.

source: །རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་མཚན་ཉིད་ནི་མེད་པ་སྟེ།
en: Subhūti, the defining characteristic of the perfection of wisdom is nonexistent.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མཚན་ཉིད་གང་ཡང་མེད་དོ། །གསོལ་པ།
en: The perfection of wisdom has no defining characteristics at all.” “

source: བཅོམ་ལྡན་འདས་མཚན་ཉིད་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མཆིས་པའི་མཚན་ཉིད་དེས་ཆོས་ཐམས་ཅད་མཆིས་པར་འགྱུར་བའི་རྣམ་གྲངས་དེ་ལྟ་བུ་མཆིས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, might it be that all phenomena exist through that defining characteristic on the basis of which the perfection of wisdom exists?” “

source: མཚན་ཉིད་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོད་པའི་མཚན་ཉིད་ཡོད་པ་དེ་ཉིད་ཀྱི་ཆོས་ཐམས་ཅད་ཡོད་དོ།
en: replied the Blessed One. “All phenomena exist through that defining characteristic on the basis of which the perfection of wisdom exists.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ནི་རང་བཞིན་གྱིས་དབེན་པ་སྟེ།
en: If you ask why, Subhūti, all phenomena are naturally void.

source: ཆོས་ཐམས་ཅད་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་དབེན་པའོ།
en: All phenomena are devoid of all phenomena.

source: །ཆོས་ཐམས་ཅད་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་པའོ།
en: All phenomena are empty of all phenomena.

source: །རབ་འབྱོར་རྣམ་གྲངས་དེས་ན་འདི་ལྟར་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དང་། དབེན་པའི་མཚན་ཉིད་དུ་མཚན་ཉིད་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོད་པའི་མཚན་ཉིད་དེས་ཆོས་ཐམས་ཅད་ཡོད་དོ།
en: For this reason, Subhūti, all phenomena exist through that defining characteristic on the basis of which the perfection of wisdom exists, that is to say, owing to the defining characteristic of emptiness and the defining characteristic of voidness.”

source: །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱིས་དབེན་ལ། ཆོས་ཐམས་ཅད་ཀྱང་ཆོས་ཐམས་ཅད་ཀྱིས་སྟོང་ན་སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་ཡང་ཇི་ལྟར་མཆིས་པར་འགྱུར།
en: Subhūti then asked, “Blessed Lord, if all phenomena are void of all phenomena and if all phenomena are empty of all phenomena, how could there be affliction and purification of beings?

source: བཅོམ་ལྡན་འདས་དབེན་པ་ནི་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར། རྣམ་པར་བྱང་བར་མི་འགྱུར།
en: Blessed Lord, voidness is neither afflicted nor purified.

source: སྟོང་པ་ཉིད་ནི་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར། རྣམ་པར་བྱང་བར་མི་འགྱུར།
en: Emptiness is neither afflicted nor purified.

source: དབེན་པ་དང་། སྟོང་པ་ཉིད་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ།
en: Voidness and emptiness do not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: དབེན་པས་ནི་སྟོང་པ་ཉིད་ལ་ཆོས་གང་ཡང་མི་དམིགས། དབེན་པས་ནི་སྟོང་པ་ཉིད་ལ་སེམས་ཅན་གང་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་ལྟ་བུ་མི་དམིགས་ན། བཅོམ་ལྡན་འདས་བསྟན་པ་དེའི་དོན་བདག་གིས་ཇི་ལྟར་འཚལ་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Voidness does not apprehend anything in emptiness, and if voidness does not apprehend any being in emptiness who would attain consummate buddhahood in unsurpassed, complete enlightenment, how then, Blessed Lord, should I understand the meaning of this teaching?” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། སེམས་ཅན་རྣམས་ཡུན་རིང་པོ་ནས་བདག་དང་བདག་གི་ཞེས་བྱ་བ་ལ་སྤྱོད་དམ།
en: Subhūti, do you think that beings engage in notions of ‘I’ and ‘mine’ for a long time?”

source: བཅོམ་ལྡན་འདས་དེ་དེ་ལགས་སོ་བདེ་བར་གཤེགས་པ་དེ་དེ་ལགས་ཏེ།
en: Blessed Lord, they do! Sugata, they do!

source: སེམས་ཅན་རྣམས་ཡུན་རིང་པོ་ནས་བདག་དང་བདག་གིར་བགྱི་བ་ལ་སྤྱོད་དོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: beings do engage for a long time in notions of ‘I’ and ‘mine.’ ” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། འོན་ཀྱང་བདག་དང་བདག་གིར་བྱ་བ་དབེན་ཞིང་སྟོང་ངམ།
en: Subhūti, do you then think that notions of ‘I’ and ‘mine’ are void and empty?”

source: །བཅོམ་ལྡན་འདས་དབེན་ནོ།
en: Blessed Lord, they are void!

source: །བདེ་བར་གཤེགས་པ་སྟོང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Sugata, they are empty!” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། འོན་ཀྱང་བདག་དང་བདག་གིར་བྱ་བས་སེམས་ཅན་རྣམས་ཀུན་དུ་རྒྱུག་ཅིང་། ཀུན་དུ་འཁོར་བར་གྱུར་ཏམ།
en: Subhūti, do you then think that beings roam and wander in cyclic existence through notions of ‘I’ and ‘mine’?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་དེ་ལྟ་ལགས་སོ།
en: Blessed Lord, it is so!

source: །བདེ་བར་གཤེགས་པ་དེ་དེ་ལྟ་ལགས་ཏེ།
en: Sugata, it is so!

source: བདག་དང་བདག་གིར་བགྱི་བས་སེམས་ཅན་རྣམས་ཀུན་དུ་རྒྱུག་ཅིང་ཀུན་དུ་འཁོར་བར་གྱུར་ཏོ།
en: beings do roam and wander in cyclic existence through notions of ‘I’ and ‘mine.’ ”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ལྟར་ན་སེམས་ཅན་རྣམས་ཀྱི་ཀུན་ནས་ཉོན་མོངས་པ་ཡོད་པ་ཡིན་ཏེ།
en: The Blessed One continued, “Subhūti, it is in that manner that there is the affliction of beings.

source: གང་ལ་བདག་ཏུ་བྱ་བ་མེད་པ་དང་། བདག་གིར་བྱ་བ་མེད་པ་དེ་ལ་འཛིན་པ་མེད།
en: When there are no notions of ‘I’ and ‘mine’ there is no grasping.

source: གང་ལ་འཛིན་པ་མེད་པ་དེ་ལ་སེམས་ཅན་ཀུན་དུ་རྒྱུག་ཅིང་། ཀུན་དུ་འཁོར་བ་མེད་དེ། དེ་ལ་ཀུན་ནས་ཉོན་མོངས་པ་གང་ཡང་མེད་པས།
en: When there is no grasping, beings do not roam and wander in cyclic existence; nothing at all is afflicted in it. {

source: རབ་འབྱོར་དེ་ལྟར་ན་སེམས་ཅན་རྣམས་ཀྱི་རྣམ་པར་བྱང་བ་ཡོད་པ་ཡིན་ནོ།
en: Ki.V: 13} Subhūti, it is in that manner that there is purification of beings.” ”

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྟར་སྤྱོད་པ་ནི་གཟུགས་ལ་མི་སྤྱོད།
en: Blessed Lord, bodhisattva great beings who practice in that manner do not engage in physical forms.

source: ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་སྤྱོད། སྐྱེ་མཆེད་དང་།
en: They do not engage in feelings, perceptions, formative predispositions, or consciousness.

source: ཁམས་ལ་མི་སྤྱོད།
en: They do not engage in the sense fields or the sensory elements.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་མི་སྤྱོད།
en: They do not engage in the links of dependent origination.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད།
en: They do not engage in the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད།
en: They do not engage in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: ནང་སྟོང་པ་ཉིད་ལ་མི་སྤྱོད། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མི་སྤྱོད།
en: They do not engage in the emptiness of internal phenomena, and they do not engage in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་མི་སྤྱོད། ཡང་དག་པར་སྤོང་བ་དང་།
en: They do not engage in the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་མི་སྤྱོད། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: They do not engage in the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་མི་སྤྱོད།
en: They do not engage in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: They do not engage in the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་མི་སྤྱོད། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མི་སྤྱོད་དོ།
en: They do not engage in [the goals], up to and including all-aspect omniscience.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་གང་སྤྱོད་པ་དང་། གང་གིས་སྤྱོད་པ་དང་། གང་ལ་སྤྱོད་པར་འགྱུར་བའི་ཆོས་དེ་དག་ཐམས་ཅད་མི་དམིགས་སོ།
en: If one were to ask why, it is because nothing is apprehended, including the phenomena that would be engaged in that manner, the phenomena through which they would engage, or the phenomena in which they would engage. “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་མི་ཐུབ་པ་སྟེ།
en: Blessed Lord, bodhisattva great beings who engage in that manner cannot be overcome by the world with its gods, humans, and asuras.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་ནོན་པར་མི་ནུས་སོ།
en: Blessed Lord, bodhisattva great beings who practice in that manner cannot be outshone by all the śrāvakas and pratyekabuddhas.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པའི་གནས་ཟིལ་གྱིས་མི་ནོན་པ་ལ་གནས་པས། བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བགྱིད་པ་དང་མ་བྲལ་བ་ནི་ཟིལ་གྱིས་མི་ནོན་པ་སྟེ།
en: If one were to ask why, it is because the status of the mature bodhisattvas is one that cannot be outshone, and so, Blessed Lord, bodhisattva great beings who never let up from focusing their attention on all-aspect omniscience cannot be outshone.

source: བཅོམ་ལྡན་འདས་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་དང་ཉེ་བར་གྱུར་པ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གལ་ཏེ་འཛམ་བུའི་གླིང་གི་སེམས་ཅན་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ལ། དེ་དག་ནམ་འཚོའི་བར་དུ་བཞུགས་པ་ལ། རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་རིམ་གྲོར་བྱས། བཀུར་བསྟིར་བྱས། བསྟི་སྟང་དུ་བྱས།
en: Blessed Lord, bodhisattva great beings who practice in that manner are approaching all-aspect omniscience.”

source: མཆོད་པར་བྱས་ཏེ། དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: The Blessed One then asked, “Subhūti, if all the many beings of Jambudvīpa, in their entirety, were to acquire a human body and attain consummate buddhahood in unsurpassed, complete enlightenment, and certain noble sons or noble daughters were, for the duration of their lives, to serve, respect, honor, and worship them, dedicating those roots of virtuous action to unsurpassed, complete enlightenment, do you think, Subhūti, that the merit of those noble sons or noble daughters would greatly increase on that basis?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཞན་ལ་སྟོན་པ་དང་། འཆད་པ་དང་། རྣམ་པར་གཞོག་པ་དང་། རབ་ཏུ་གཞོག་པ་དང་། འགྲེལ་པ་དང་།
en: Subhūti,” continued the Blessed One, “when noble sons or noble daughters {Ki.

source: རྣམ་པར་འབྱེད་པ་དང་། གསལ་བར་བྱེད་པ་དང་། ཡང་དག་པར་སྟོན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ལྡན་པའི་ཡིད་ལ་བྱེད་པས་རྣམ་པར་སྤྱོད་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ།
en: V: 14} teach, explain, establish, definitively establish, interpret, analyze, elucidate, and genuinely reveal this perfection of wisdom to others, and practice while directing their mind to the perfection of wisdom, their merit will increase even more than that! “

source: །རབ་འབྱོར་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་གྱི་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ཏེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པར་གྱུར་ལ། དེ་དག་ནམ་འཚོའི་བར་དུ་བཞུགས་པ་ལ། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་རིམ་གྲོར་བྱས། བཀུར་བསྟིར་བྱས། བསྟི་སྟང་དུ་བྱས། མཆོད་པ་བྱས་ཏེ། དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ།
en: Subhūti, if all the many beings [of the world realms], up to and including the world system of the great trichiliocosm, in their entirety, were to acquire a human body and attain consummate buddhahood in unsurpassed, complete enlightenment, and certain noble sons or noble daughters were, for the duration of their lives, to serve, respect, honor, and worship them, dedicating those roots of virtuous action to unsurpassed, complete enlightenment, do you think, Subhūti, that the merit of those noble sons or noble daughters would greatly increase on that basis?” “

source: བདེ་བར་གཤེགས་པ་མང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཞན་ལ་སྟོན་པ་དང་། འཆད་པ་དང་། རྣམ་པར་གཞོག་པ་དང་། རབ་ཏུ་གཞོག་པ་དང་། །འགྲེལ་པ་དང་།
en: Sugata, it would!” “

source: །རབ་འབྱོར་གལ་ཏེ་འཛམ་བུ་གླིང་གི་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། དེ་དག་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་པ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུ
en: Subhūti, if all the many beings of Jambudvīpa, in their entirety, were to acquire a human body and certain noble sons or noble daughters were to establish them in the paths of the ten virtuous actions, and establish them in the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, individual enlightenment, and unsurpassed, complete enlightenment, dedicating those roots of virtuous action to unsurpassed, complete enlightenment, do you think, Subhūti, that the merit of those noble sons or noble daughters would greatly increase on that basis?” “

source: གས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དེ། དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ངོ་།
en: Blessed Lord, it would!

source: རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཞན་ལ་སྟོན་པ་དང་། འཆད་པ་དང་། རྣམ་པར་གཞོག་པ་དང་། རབ་ཏུ་གཞོག་པ་དང་། འགྲེལ་པ་དང་། རྣམ་པར་འབྱེད་པ་དང་། གསལ་བར་བྱེད་པ་དང་། ཡང་དག་པར་རབ་ཏུ་སྟོན་ན།
en: Subhūti,” continued the Blessed One, “when noble sons or noble daughters teach, explain, establish, definitively establish, interpret, analyze, elucidate, and genuinely reveal this perfection of wisdom to others, their merit will increase even more than that! “

source: དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །རབ་འབྱོར་གལ་ཏེ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་བར་གྱི་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་སྔ་ཕྱི་མེད་པར་མིའི་ལུས་ཐོབ་པར་གྱུར་ལ། དེ་དག་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་གིས་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་བཀོད་པ་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུ
en: Subhūti, if all the many beings [of the world realms], up to and including the world system of the great trichiliocosm, in their entirety, were to acquire a human body, and certain noble sons or noble daughters were to establish them in the paths of the ten virtuous actions, and establish them in the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment, and if they were to establish them in unsurpassed, complete enlightenment, dedicating those roots of virtuous action to unsurpassed, complete enlightenment, do you think, Subhūti, that the merit of those noble sons or noble daughters would greatly increase on that basis?” “

source: གས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རབ་ཏུ་བཀོད་དེ། དགེ་བའི་རྩ་བ་དེ་ཡང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་ན། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་དེའི་རྒྱུས་མང་དུ་འཕེལ་ལམ། གསོལ་པ། བཅོམ་ལྡན་འདས་མང་ངོ་།
en: Blessed Lord, it would!

source: རབ་འབྱོར་དེ་བས་ཀྱང་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་གཞན་ལ་སྟོན་པ་དང་། འཆད་པ་དང་། རྣམ་པར་གཞོག་པ་དང་། རབ་ཏུ་གཞོག་པ་དང་། འགྲེལ་པ་དང་། རྣམ་པར་འབྱེད་པ་དང་།
en: Subhūti,” continued the Blessed One, “when noble sons or noble daughters teach, explain, establish, definitively establish, interpret, analyze, elucidate, and genuinely reveal this perfection of wisdom to others, their merit will increase even more than that! “

source: གསལ་བར་བྱེད་པ་དང་། ཡང་དག་པར་སྟོན་ན། དེའི་བསོད་ནམས་ཆེས་མང་དུ་འཕེལ་ལོ། །རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས་རྣམ་པར་འབྱེད་པ་ནི། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྦྱིན་པའི་གནས་སུ་འགྲོ་བ་ཡིན་ཏེ།
en: Subhūti, bodhisattva great beings who practice in that manner and undertake this analysis while focusing their attention with all-aspect omniscience in mind become worthy recipients of the donations of all beings.
